Revit 2026 API
GeometryCreationUtilities.CreateExtrusionGeometry Method
Overload List
Name | Description
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double)
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double, SolidOptions)
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace